JoseTrinidadLM/GRID_FORMING_STM32F446RE_PA/GRID_FORMING/drivers/Src/stm32f446xx_control.c
/*
 * stm32f446xx_control.c
 *
 *  Created on: Nov 18, 2025
 *      Author: jiperez
 */

#include "stm32f446xx_control.h"

static GPIO_Handle_t PWM_EN;
static GPIO_Handle_t LOOP_SEL;

static GPIO_Handle_t GpioPWMA;
static GPIO_Handle_t GpioPWMB;

static GPIO_Handle_t GPIO_Sensor[4];
static ADC_Handle_t ADC_1;
static DMA_Handle_t DMA2_ADC1Handle;


static TIM_Handle_t TIM_2;

static TIM_Handle_t TIM_4;
static PWM_Config_t TIM4_PWM_Channel_1;
static PWM_Config_t TIM4_PWM_Channel_2;

int valid_send = FLAG_SET;		//Flag to indicate when data packet is ready to be sent

/*Buffers to store quarter of a period of cos and i_L*/
/*For every shifted signal it is needed a buffer*/
float cos_buffer[40] = {RESET};
float i_L_buffer[40] = {RESET};


/*Control global variables*/
__vo float e1_z_0 = RESET;
__vo float e1_z_1 = RESET;

__vo float e2_z_0 = RESET;
__vo float e2_z_1 = RESET;

__vo float y1_z_0 = RESET;
__vo float y1_z_1 = RESET;

__vo float y2_z_0 = RESET;
__vo float y2_z_1 = RESET;

/*Flags and counters used for 90-degree shiftimg*/
__vo static uint8_t Buffer_Counter_Cos = RESET;
__vo static uint8_t Buffer_Ready_Flag_Cos = RESET;

__vo static uint8_t Buffer_Counter_iL = RESET;
__vo static uint8_t Buffer_Ready_Flag_iL = RESET;

uint64_t BUFFER_SIZE = BUFFER_LENGTH_9;

/*characterized sensor outputs*/
float v_cd;
float v_g;
float i_L;
float i_L90;
float i_inv;

uint32_t raw_sensor_value[4];

float ElapsedTime = START_TIME;	//Elapsed time variable

/*sine wave for DQ and power-factor correction*/
float cosine;
float sine;

float i_Q;

/*modulator signal*/
__vo uint16_t u_control_pos;
__vo uint16_t u_control_neg;

uint8_t systemState;

/*********************************************************************************************************************************************************************
 * @fn		               ResetTime
 *
 * @brief                  Resets the global elapsed time counter to the predefined start value.
 *
 * @param  	      		   None
 *
 * @return                 None
 *
 * @Requirements           TO-DO
 *********************************************************************************************************************************************************************/
void ResetTime(void)
{
	ElapsedTime = START_TIME;
}

/*********************************************************************************************************************************************************************
 * @fn 			           Utility_GPIOInits
 *
 * @brief                  Initializes GPIO pins PB14 and PB15 as input with interrupt capability (EXTI15_10) to control PWM on/off and change operation mode.
 *
 * @param	               None
 *
 * @return                 None
 *
 * @Requirements           TO-DO
 *********************************************************************************************************************************************************************/
void Utility_GPIOInits(void)
{
	GPIO_PClkC(GPIOB, ENABLE);
	PWM_EN.pGPIOx = GPIOB;
	PWM_EN.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_14;
	PWM_EN.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IT_RT;
	PWM_EN.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	GPIO_Init(&PWM_EN);

	LOOP_SEL.pGPIOx = GPIOB;
	LOOP_SEL.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_15;
	LOOP_SEL.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IT_RT;
	LOOP_SEL.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	GPIO_Init(&LOOP_SEL);

	GPIO_IRQInterruptConfig(IRQ_NO_EXTI15_10,ENABLE);
	GPIO_IRQPriorityConfig(IRQ_NO_EXTI15_10, 0);
}

/*********************************************************************************************************************************************************************
 * @fn         			   PWM_GPIOInits
 *
 * @brief                  Configures GPIO pins PB6 and PB7 for PWM output by setting them to alternate function mode with high-speed output.
 *
 * @param                  None
 *
 * @return                 None
 *
 * @Requirements           TO-DO
 *********************************************************************************************************************************************************************/
void PWM_GPIOInits(void)
{
	GPIO_PClkC(GPIOB, ENABLE);

	GpioPWMA.pGPIOx = GPIOB;
	GpioPWMA.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_7;
	GpioPWMA.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	GpioPWMA.GPIO_PinConfig.GPIO_PinAltFunMode = 2;
	GpioPWMA.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;
	GpioPWMA.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	GpioPWMA.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_Init(&GpioPWMA);

	GpioPWMB.pGPIOx = GPIOB;
	GpioPWMB.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
	GpioPWMB.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	GpioPWMB.GPIO_PinConfig.GPIO_PinAltFunMode = 2;
	GpioPWMB.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;
	GpioPWMB.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	GpioPWMB.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_Init(&GpioPWMB);
}
/*********************************************************************************************************************************************************************
 * @fn        			   Sensors_Init
 *
 * @brief                  Initializes GPIO pins for analog sensor inputs, configures ADC1 for multi-channel conversion triggered by TIM2, and sets up DMA for 
 * 						   continuous data transfer to memory.
 * 
 * @param             	   pDest – Pointer to the destination buffer where ADC conversion results will be stored.
 *
 * @return                 None
 * 
 * @note				   Add as much sensors you want to read (look up pinout for compatibility)
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
void Sensors_Init(void *pDest) //For this application only 4 sensors will be initialized
{
	/*****************GPIO analog inputs initialization*****************/
	GPIO_PClkC(GPIOA, ENABLE);

	GPIO_Sensor[0].pGPIOx = GPIOA;
	GPIO_Sensor[0].GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ANALOG;
	GPIO_Sensor[0].GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GPIO_Sensor[0].GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	GPIO_Init(&GPIO_Sensor[0]);

	GPIO_Sensor[1].pGPIOx = GPIOA;
	GPIO_Sensor[1].GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ANALOG;
	GPIO_Sensor[1].GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_1;
	GPIO_Sensor[1].GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	GPIO_Init(&GPIO_Sensor[1]);

