JoseTrinidadLM/GRID_FORMING_STM32F446RE_PA/GRID_FORMING/drivers/Src/stm32f446xx_control.c
	/*****************Master Timer initialization*****************/
	TIM_PClkC(TIM4, ENABLE);

	TIM_4.pTIMx = TIM4;
	TIM_4.TIM_Config.TIM_Frequency = carrier_frequency*2;
	TIM_4.TIM_Config.TIM_CLKDivision = TIM_CKD_DIV1;
	TIM_4.TIM_Config.TIM_AutoReloadPreload = TIM_ARPE_ENABLE;
	TIM_4.TIM_Config.TIM_CAModeSel = TIM_CMS_CA_1;
	TIM_4.TIM_Config.TIM_IntEnable = TIM_IT_DISABLE;
	TIM_4.TIM_Config.TIM_MasterModeSel = TIM_MMS_RESET;

	TIM_Init(&TIM_4);

	TIM4_PWM_Channel_1.PWM_Channel = PWM_CHANNEL_1;
	TIM4_PWM_Channel_1.PWM_OCMode = TIM_PWM_MODE2;
	TIM4_PWM_Channel_1.PWM_OCPolarity = PWM_OC_POLARITY_HIGH;
	TIM4_PWM_Channel_1.PWM_OCPolarity  = PWM_OC_PRELOAD_DISABLED;

	TIM_PWM_Channel_Init(&TIM_4, &TIM4_PWM_Channel_1);

	TIM4_PWM_Channel_2.PWM_Channel = PWM_CHANNEL_2;
	TIM4_PWM_Channel_2.PWM_OCMode = TIM_PWM_MODE2;
	TIM4_PWM_Channel_2.PWM_OCPolarity = PWM_OC_POLARITY_HIGH;
	TIM4_PWM_Channel_2.PWM_OCPolarity  = PWM_OC_PRELOAD_DISABLED;

	TIM_PWM_Channel_Init(&TIM_4, &TIM4_PWM_Channel_2);
}

/*********************************************************************************************************************************************************************
 * @fn                     NINETYDegreePhaseShift
 *
 * @brief                  Generates a 90° phase-shifted signal from a cosine wave by using a circular buffer that stores one-quarter of a 60 Hz period.
 * 
 * @param                  pCos_Buffer – Pointer to the buffer storing cosine samples.
 * @param                  cos_wave – Current cosine sample to be added to the buffer.
 * @param                  pBuffer_Counter – Pointer to the buffer index counter (updated each call).
 * @param                  pBuffer_Ready_Flag – Pointer to a flag indicating when the buffer is fully populated.
 *
 * @return                 temp_sin – A float representing the sine value (90° phase shift) derived from the buffer.
 * 
 * @note                   - Designed for a 60 Hz signal with a sampling rate of 9.6 kHz.
 *                         - Buffer stores 40 samples (¼ of a 60 Hz period).
 *                         - Implements a ring-buffer mechanism for continuous phase-shift generation.
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
float NINETYDegreePhaseShift(float *pCos_Buffer, float cos_wave, __vo uint8_t *pBuffer_Counter, __vo uint8_t *pBuffer_Ready_Flag)
{
	float temp_sin = RESET;

	//temp_sin stores a 90-degree phase shift signal
	//This buffer stores a quarter a of period of a 60 Hz sine wave
	if(*pBuffer_Ready_Flag == FLAG_SET) temp_sin =  pCos_Buffer[*pBuffer_Counter];

	//Updates current buffer after saving the temp_sine wave

	pCos_Buffer[*pBuffer_Counter] = cos_wave;

	//Counter updates
	(*pBuffer_Counter)++;

	//Once the buffer is completely filled counter is reset
	if(*pBuffer_Counter >= 40)									//This condition is subject to sampling rate being 9.6 kHz and grid-load fundamental frequency are 60 Hz
	{															//Buffer may be larger but to store and create a ring-buffer we only take account of the first quarter of a period
		*pBuffer_Ready_Flag = FLAG_SET;
		*pBuffer_Counter = RESET;
	}
	return temp_sin;
}

/*********************************************************************************************************************************************************************
 * @fn                     DTransform
 *
 * @brief                  Computes the quadrature-axis component of the Park Transformation using two-phase orthogonal components.
 * 
 * @param                  cosine_wt – Cosine of the electrical angle (ωt).
 * @param                  sine_wt   – Sine of the electrical angle (ωt).
 * @param                  alpha     – α-axis component.
 * @param                  beta      – β-axis component.
 *
 * @return                 Quadrature-axis component (float).
 * 
 * @note                   This function performs a partial Park Transformation, returning only the q-axis value.
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
float DTransform(float cosine_wt, float sine_wt, float alpha, float beta)
{
	return (alpha*cosine_wt + beta*sine_wt);
}

/*********************************************************************************************************************************************************************
 * @fn                     QTransform
 *
 * @brief                  Computes the direct-axis component of the Park Transformation using two-phase orthogonal components.
 * 
 * @param                  cosine_wt – Cosine of the electrical angle (ωt).
 * @param                  sine_wt   – Sine of the electrical angle (ωt).
 * @param                  alpha     – α-axis component.
 * @param                  beta      – β-axis component.
 *
 * @return                 Direct-axis component (float).
 * 
 * @note                   This function performs a partial Park Transformation, returning only the d-axis value.
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
float QTransform(float cosine_wt, float sine_wt, float alpha, float beta)
{
	return (-alpha*sine_wt + beta*cosine_wt);
}

/*********************************************************************************************************************************************************************
 * @fn                     CascadeControl
 *
 * @brief                  Implements a cascaded control strategy with two discrete PI loops: 
 *                         - Outer loop regulates DC bus voltage.
 *                         - Inner loop regulates inverter current using Park Transformation components.
 *                         Updates PWM duty cycles for positive and negative signals based on control output.
 * 
 * @param                  cosine_wt   – Cosine of the electrical angle (ωt).
 * @param                  sine_wt     – Sine of the electrical angle (ωt).
 * @param                  V_CD        – Measured DC bus voltage.
 * @param                  I_Q         – Quadrature current component.
 * @param                  I_INV       – Measured inverter current.
 * @param                  pe1_z_0     – Pointer to current error of outer PI loop.
 * @param                  pe1_z_1     – Pointer to previous error of outer PI loop.
 * @param                  pe2_z_0     – Pointer to current error of inner PI loop.
 * @param                  pe2_z_1     – Pointer to previous error of inner PI loop.
 * @param                  py1_z_0     – Pointer to current output of outer PI loop.
 * @param                  py1_z_1     – Pointer to previous output of outer PI loop.
 * @param                  py2_z_0     – Pointer to current output of inner PI loop.
 * @param                  py2_z_1     – Pointer to previous output of inner PI loop.
 * @param                  u_pos       – Pointer to positive PWM duty cycle (uint16_t).
 * @param                  u_neg       – Pointer to negative PWM duty cycle (uint16_t).
 *
 * @return                 None
 * 
 * @note                   - Sampling rate is tightly coupled to control parameters (designed for ~9600 Hz).
 *                         - Local variables are written in uppercase to differentiate from global variables.
 *                         - Saturation limits applied to inner loop output: [-0.99, 0.99].
 *                         - PWM duty cycles computed relative to TIM4->ARR register.
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/

void CascadeControl(float cosine_wt, float sine_wt, float V_CD, float I_Q, float I_INV, __vo float *pe1_z_0, __vo float *pe1_z_1, __vo float *pe2_z_0, __vo float *pe2_z_1, __vo float *py1_z_0, __vo float *py1_z_1, __vo float *py2_z_0, __vo float *py2_z_1, __vo uint16_t *u_pos, __vo uint16_t *u_neg)
{
	float u_pos_temp = RESET;
	float u_neg_temp = RESET;

	(*pe1_z_0) = 36 - V_CD;														//Evaluates error among reference and DC sensed value on DC bus of the inverter

	(*py1_z_0) = (*py1_z_1) + 0.167037*(*pe1_z_0) - 0.167028*(*pe1_z_1);		//External discrete PI control loop

	(*pe1_z_1) = (*pe1_z_0);													//Updating last error as the most recent one
	(*py1_z_1) = (*py1_z_0);													//Updating last output PI control value as the most recent one

	(*pe2_z_0) = (*py1_z_0)*cosine_wt + (7.8 + I_Q)*sine_wt - I_INV; 			//Calculates the new error with a reference given by external control loop output, quadrature current and inverter sense current

	(*py2_z_0) = (*py2_z_1) - 0.03203*(*pe2_z_0) + 0.03087*(*pe2_z_1); 			//Internal discrete PI control loop

