JoseTrinidadLM/GRID_FORMING_STM32F446RE_PA/GRID_FORMING/drivers/Src/stm32f446xx_control.c
	if((*py2_z_0)> (0.99)) (*py2_z_0) = 0.99;
	if((*py2_z_0)< (-0.99)) (*py2_z_0) = -0.99;									//Setting boundaries for control signal

	(*pe2_z_1) = (*pe2_z_0);													//Updating last error as the most recent one
	(*py2_z_1) = (*py2_z_0);													//Updating last output PI control value as the most recent one

	u_pos_temp = (((*py2_z_0 )*(0.5)) + 0.5)*(TIM4->ARR);
	u_neg_temp = (((*py2_z_0 )*(-0.5)) + 0.5)*(TIM4->ARR);

	(*u_pos) = (uint16_t)u_pos_temp;				 							//Updates positive control signal in relation to PWM resolution
	(*u_neg) = (uint16_t)u_neg_temp;											//Updates negative control signal in relation to PWM resolution

}

/*********************************************************************************************************************************************************************
 * @fn                     OpenLoop
 *
 * @brief                  Generates open-loop PWM duty cycles based on a cosine reference signal. Updates positive and negative control signals relative to TIM4 ARR.
 * 
 * @param                  cosine_wt – Cosine of the electrical angle (ωt).
 * @param                  u_pos     – Pointer to positive PWM duty cycle (uint16_t).
 * @param                  u_neg     – Pointer to negative PWM duty cycle (uint16_t).
 *
 * @return                 None
 * 
 * @note                   - Computes duty cycles using a normalized cosine signal.
 *                         - Positive and negative signals are scaled to the PWM resolution defined by TIM4->ARR.
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
void OpenLoop(float cosine_wt, __vo uint16_t *u_pos, __vo uint16_t *u_neg)
{
	float u_pos_temp = RESET;
	float u_neg_temp = RESET;

	u_pos_temp = ((cosine_wt*0.4) + 0.5)*(TIM4->ARR);
	u_neg_temp = ((-cosine_wt*0.4) + 0.5)*(TIM4->ARR);

	(*u_pos) = (uint16_t)u_pos_temp;				 							//Updates positive control signal in relation to PWM resolution
	(*u_neg) = (uint16_t)u_neg_temp;											//Updates negative control signal in relation to PWM resolution
}

/*********************************************************************************************************************************************************************
 * @fn                     ResetPIControllers
 *
 * @brief                  Resets all input-output parameters of the cascaded PI controllers used in CascadeControl() to zero.
 * 
 * @param                  pe1_z_0 – Pointer to current error of outer PI loop.
 * @param                  pe1_z_1 – Pointer to previous error of outer PI loop.
 * @param                  pe2_z_0 – Pointer to current error of inner PI loop.
 * @param                  pe2_z_1 – Pointer to previous error of inner PI loop.
 * @param                  py1_z_0 – Pointer to current output of outer PI loop.
 * @param                  py1_z_1 – Pointer to previous output of outer PI loop.
 * @param                  py2_z_0 – Pointer to current output of inner PI loop.
 * @param                  py2_z_1 – Pointer to previous output of inner PI loop.
 *
 * @return                 None
 * 
 * @note                   This function is typically called during system initialization or when resetting control states after a mode change.
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
void ResetPIControllers(__vo float *pe1_z_0, __vo float *pe1_z_1, __vo float *pe2_z_0, __vo float *pe2_z_1, __vo float *py1_z_0, __vo float *py1_z_1, __vo float *py2_z_0, __vo float *py2_z_1)
{
	(*pe1_z_0) = RESET;
	(*pe1_z_1) = RESET;

	(*py1_z_0) = RESET;
	(*py1_z_1) = RESET;

	(*pe2_z_0) = RESET;
	(*pe2_z_1) = RESET;

	(*py2_z_0) = RESET;
	(*py2_z_1) = RESET;
}

/*********************************************************************************************************************************************************************
 * @fn                     PWM_Enable
 *
 * @brief                  Enables PWM output on TIM4 channels 1 and 2.
 * 
 * @param                  None
 *
 * @return                 None
 * 
 * @note                   Uses TIM_PWM_Enable() to activate PWM signals on both configured channels.
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
void PWM_Enable(void)
{
	TIM_PWM_Enable(&TIM_4, &TIM4_PWM_Channel_1);
	TIM_PWM_Enable(&TIM_4, &TIM4_PWM_Channel_2);
}

/*********************************************************************************************************************************************************************
 * @fn                     PWM_Disable
 *
 * @brief                  Disables PWM output on TIM4 channels 1 and 2 and resets GPIO pins PB6 and PB7 to LOW state.
 * 
 * @param                  None
 *
 * @return                 None
 * 
 * @note                   - Calls TIM_PWM_Disable() for both channels.
 *                         - Ensures GPIO pins PB6 and PB7 are set to RESET to avoid floating outputs.
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
void PWM_Disable(void)
{
	TIM_PWM_Disable(&TIM_4, &TIM4_PWM_Channel_1);
	TIM_PWM_Disable(&TIM_4, &TIM4_PWM_Channel_2);

	GPIO_WriteToOutputPin(GPIOB, GPIO_PIN_NO_7, RESET);
	GPIO_WriteToOutputPin(GPIOB, GPIO_PIN_NO_6, RESET);
}

/*********************************************************************************************************************************************************************
 * @fn                     PWM_dutyCycle_control
 *
 * @brief                  Updates the PWM duty cycle for TIM4 channels 1 and 2 based on the provided values.
 * 
 * @param                  u_pos – Duty cycle value for PWM channel 1 (uint16_t).
 * @param                  u_neg – Duty cycle value for PWM channel 2 (uint16_t).
 *
 * @return                 None
 * 
 * @note                   - Uses TIM_PWM_DutyCycle() to apply new duty cycle values.
 *                         - Duty cycle values should be within the range defined by TIM4->ARR.
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
void PWM_dutyCycle_control(uint16_t u_pos ,uint16_t u_neg)
{
	TIM_PWM_DutyCycle(&TIM_4, &TIM4_PWM_Channel_1, u_pos);
	TIM_PWM_DutyCycle(&TIM_4, &TIM4_PWM_Channel_2, u_neg);
}

/*********************************************************************************************************************************************************************
 * @fn                     TIM2_IRQHandling
 *
 * @brief                  Handles the interrupt request for TIM2 by calling the corresponding IRQ handler function.
 * 
 * @param                  None
 *
 * @return                 None
 * 
 * @note                   Delegates interrupt handling to TIM_IRQHandling() for TIM2.
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
void TIM2_IRQHandling(void)
{
	TIM_IRQHandling(&TIM_2);
}

/*********************************************************************************************************************************************************************
 * @fn                     ControlInit
 *
 * @brief                  Initializes all essential peripherals and configurations for the control system, including GPIO, sensors, timers, and PWM.
 * 
 * @param                  None
 *
 * @return                 None
 * 
 * @note                   - Calls initialization routines for GPIO inputs, PWM outputs, sensor ADC with DMA, sampling timer, and PWM timer.
 *                         - Uses global constants `SAMPLING_FREQUENCY` and `PWM_FREQUENCY` for timing configuration.
 *                         - Passes `raw_sensor_value` buffer to Sensors_Init() for DMA data storage.
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
void ControlInit(void)
{
	Utility_GPIOInits();
	PWM_GPIOInits();
	Sensors_Init((void*)raw_sensor_value);
	SamplingRateTIMInit(SAMPLING_FREQUENCY);
	PWM_TIMInits(PWM_FREQUENCY);
}

/*********************************************************************************************************************************************************************
 * @fn                     Control_Start
 *
 * @brief                  Starts the control system by enabling timers and initiating DMA transfer for sensor data acquisition.
 * 
 * @param                  None
 *
 * @return                 None
 * 
 * @note                   - TIM2 is started to generate sampling triggers for ADC conversions.
 *                         - TIM4 is started to enable PWM generation (initial tests).
 *                         - DMA transfer begins to continuously move ADC data to the destination buffer.
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
void Control_Start(void)
{
	TIM_Start(&TIM_2);
	PWM_Disable();
	TIM_Start(&TIM_4);
	DMA_StartTransfer(&DMA2_ADC1Handle);
}

/*********************************************************************************************************************************************************************
 * @fn                     Control_Stop
 *
 * @brief                  Stops the control system by disabling timers, halting DMA transfers, turning off PWM outputs, and clearing internal buffers.
 * 
 * @param                  None
 *
 * @return                 None
 * 
 * @note                   - TIM2 and TIM4 are stopped to halt sampling and PWM generation.
 *                         - DMA transfer for ADC data acquisition is disabled.
 *                         - PWM outputs are turned off using PWM_Disable().
 *                         - Clears `cos_buffer` and `i_L_buffer` arrays (40 elements each) to reset stored data.
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
void Control_Stop(void)
{
	TIM_Stop(&TIM_2);
	TIM_Stop(&TIM_4);
	DMA_StopTransfer(&DMA2_ADC1Handle);
	PWM_Disable();
	for (int i=0; i<40; i++) 
	{
		cos_buffer[i] = 0;
		i_L_buffer[i] = 0;
	}
}

/*********************************************************************************************************************************************************************
 * @fn                     Control_ReadSensors
 *
 * @brief                  Reads raw ADC sensor values, normalizes them to a [-1, 1] range, updates global variables, and optionally stores them in the provided buffer.
 * 
 * @param                  values – Pointer to a float array where processed sensor values will be stored (size ≥ 5).
 *
 * @return                 uint8_t – Returns `valid_send` flag indicating whether new data was stored (FLAG_SET or FLAG_RESET).
 * 
 * @note                   - Converts raw ADC readings (12-bit resolution) to normalized values using the formula: ((raw / 4095) - 0.5) * 2.
 *                         - Updates global variables: `v_g`, `i_inv`, `i_L`, `v_cd`, and increments `ElapsedTime` based on sampling rate (9600 Hz).
 *                         - Stores values in the array only when `valid_send == FLAG_SET`; otherwise toggles the flag.
 *                         - The output array contains: [v_g, i_L, i_inv, v_cd, ElapsedTime].
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
uint8_t Control_ReadSensors(float* values)
{

