JoseTrinidadLM/GRID_FORMING_STM32F446RE_PA/GRID_FORMING/drivers/Src/stm32f446xx_control.c
	v_g = 	(raw_sensor_value[0]/ADC_RESOLUTION - ADC_OFFSET_VOLTAGE)*ADC_VOLTAGE_REF*ADC_GRID_VOLTAGE_K;
	i_inv = (raw_sensor_value[1]/ADC_RESOLUTION - ADC_OFFSET_VOLTAGE)*ADC_VOLTAGE_REF*ADC_INV_CURRENT_K;
	i_L = 	(raw_sensor_value[2]/ADC_RESOLUTION - ADC_OFFSET_VOLTAGE)*ADC_VOLTAGE_REF*ADC_LOAD_CURRENT_K;
	v_cd = 	(raw_sensor_value[3]/ADC_RESOLUTION)*ADC_DC_VOLTAGE_K;

	if (valid_send == FLAG_SET) {
		values[0] = v_g;
		values[1] = i_L ;
		values[2] = i_inv;
		values[3] = v_cd;
		values[4] = ElapsedTime;
		valid_send = FLAG_RESET;
	}else {
		valid_send = FLAG_SET;
	}
	return valid_send;
}

/*********************************************************************************************************************************************************************
 * @fn                     Control_DutyCycle
 *
 * @brief                  Computes PWM duty cycles based on the selected operation mode. Applies signal processing, phase shifting, and control algorithms.
 * 
 * @param                  None
 *
 * @return                 None
 * 
 * @note                   - Filters signals if noise is present (future implementation).
 *                         - Calculates `cosine` from `v_g` and computes `sine` using a 90° phase shift via NINETYDegreePhaseShift().
 *                         - Computes quadrature current component `i_Q` using QTransform().
 *                         - If `systemState` bit 0 is DISABLE → Executes OpenLoop() for PWM control.
 *                         - Else → Executes CascadeControl() for closed-loop control using PI regulators.
 *                         - Updates PWM duty cycles through PWM_dutyCycle_control() using computed positive and negative control signals.
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
void Control_DutyCycle(void)
{
	/*In case there is a high presence of noise, signals will be filtered*/

	cosine = v_g/18.0f;

	sine = NINETYDegreePhaseShift(cos_buffer, cosine, &Buffer_Counter_Cos, &Buffer_Ready_Flag_Cos);

	i_L90 = NINETYDegreePhaseShift(i_L_buffer, i_L, &Buffer_Counter_iL, &Buffer_Ready_Flag_iL);
	
	i_Q = QTransform(cosine, sine, i_L, i_L90);

	if((systemState & 0b1) == DISABLE)
	{
		OpenLoop(cosine, &u_control_pos, &u_control_neg);

	} else
	{
		CascadeControl(cosine, sine, v_cd, i_Q, i_inv, &e1_z_0, &e1_z_1, &e2_z_0, &e2_z_1, &y1_z_0, &y1_z_1, &y2_z_0, &y2_z_1, &u_control_pos, &u_control_neg);
	}

	PWM_dutyCycle_control(u_control_pos, u_control_neg);
}

/*********************************************************************************************************************************************************************
 * @fn                     Control_Mode
 *
 * @brief                  Sets the control system operation mode (Open Loop or Closed Loop) and power state (Enable or Disable). Handles safe transitions by resetting PI controllers when switching to Open Loop.
 * 
 * @param                  Power – Indicates whether the system should be powered ON (ENABLE) or OFF (DISABLE).
 * @param                  Loop  – Indicates whether the control loop should operate in Closed Loop (ENABLE) or Open Loop (DISABLE).
 *
 * @return                 uint8_t – Returns the updated `systemState` status flag.
 * 
 * @note                   - If `Loop == DISABLE`, resets PI controllers and sets Open Loop mode.
 *                         - If `Loop == ENABLE`, sets Closed Loop mode.
 *                         - If `Power == DISABLE`, stops control system and sets PWM status to OFF.
 *                         - If `Power == ENABLE`, starts control system and sets PWM status to ON.
 *                         - Uses macros: `SET_OPEN_LOOP_MODE`, `SET_CLOSED_LOOP_MODE`, `SYSTEM_OFF_FLAG`, `SYSTEM_ON_FLAG`.
 *
 * @Requirements           TO-DO
 * 
 *********************************************************************************************************************************************************************/
uint8_t Control_Mode(uint8_t Power, uint8_t Loop)
{
	/*When Operation Mode is zero it resets PI controllers from CascadeControl(), to assure safe and smooth transition to Closed Loop Mode Operation*/
	if( Power == DISABLE && ((systemState >> SYSTEM_STATUS_FLAG) & 0b1) == FLAG_SET )
	{
		Control_Stop(); 
		SYSTEM_OFF_FLAG(systemState);	//Set System Status Flag to Disabled
		SET_OPEN_LOOP_MODE(systemState); //Set Loop Status Flag to Open
	} else if( Power == ENABLE && ((systemState >> SYSTEM_STATUS_FLAG) & 0b1) == FLAG_RESET )
	{
		Control_Start(); 
		SYSTEM_ON_FLAG(systemState); //Set System Status Flag to Enabled
	}
	if((systemState >> SYSTEM_STATUS_FLAG) & 0b1)
	{
		if( Loop == DISABLE && (systemState >> MODE_FLAG) == FLAG_SET)
		{
			ResetPIControllers(&e1_z_0, &e1_z_1, &e2_z_0, &e2_z_1, &y1_z_0, &y1_z_1, &y2_z_0, &y2_z_1);
			SET_OPEN_LOOP_MODE(systemState); //Set Loop Status Flag to Open
		} else if ( Loop == ENABLE && (systemState >> MODE_FLAG) == FLAG_RESET)
		{
			SET_CLOSED_LOOP_MODE(systemState); //Set Loop Status Flag to Closed
		}
	}
	return systemState;
}

/*********************************************************************************************************************************************************************
 * @fn		  				- ShiftSensorsValue
 *
 * @brief					- Pending function to shift processed sensor values in a buffer for further analysis or filtering.
 *
 * @param					None
 *
 * @return					- None
 *
 * @Requirements			- TO-DO
 *********************************************************************************************************************************************************************/
void ShiftSensorsValue(void)
{
	for(uint64_t x = BUFFER_SIZE-1; x>0; x--)
	{
		//TO-DO: shift processed values
		;
	}
}
